IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/RTI0_CFG.xml
	<register id="CFG_WDKEY" acronym="CFG_WDKEY" offset="0x9C" width="32" description="">
		<bitfield id="WDKEY" width="16" begin="15" end="0" resetval="0x41820" description="  User and privilege mode reads are indeterminate.  Privilege mode (write):  A write of 0xE51A followed by 0xA35C in two separate write operations defines the Key  Sequence and discharges the watchdog capacitor. This also causes the upper 12 bits of  the DWD down counter to be reloaded with the contents of the DWD preload register and  the lower 13 bits to become all 1's. Writing any other value causes a digital watchdog reset,  as shown in Table 1-3.  Note: Register write access time precaution  The user has to take into account that the write to the register takes 3 VCLK cycle.  This needs to be considered for the AWD/DWD expiration calculation.  Table 2. Example of a WDKEY sequence  Value written to  Step WDKEY Result  1 0x0A35C No Action  2 0x0A35C No Action  3 0x0E51A WDKEY is enabled for reset by next 0x0A35C  4 0x0E51A WDKEY is enabled for reset by next 0x0A35C  5 0x0E51A WDKEY is enabled for reset by next 0x0A35C  6 0x0A35C Watchdog is reset  7 0x0A35C No Action  8 0x0E51A WDKEY is enabled for reset by next 0x0A35C  9 0x0A35C Watchdog is reset  10 0x0E51A WDKEY is enabled for reset by next 0x0A35C  11 0x02345 System reset; incorrect value written to WDKEY" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DWDCNTR" acronym="CFG_DWDCNTR" offset="0xA0" width="32" description="">
		<bitfield id="DWDCNTR" width="25" begin="24" end="0" resetval="0x33554431" description="  The value of the DWDCNTR after a system reset is 0x002D_FFFF. When the DWD is  enabled and the DWD counter starts counting down from this value with an RTICLK1 time  base of 3MHz, a watchdog reset will be generated in 1 second.  User and privilege mode (read):  Reads return the current counter value.  Privilege mode (write):  Writes don't have an effect." range="24 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_WWDRXNCTRL" acronym="CFG_WWDRXNCTRL" offset="0xA4" width="32" description="">
		<bitfield id="WWDRXN" width="4" begin="3" end="0" resetval="0x5" description="  User and privilege mode (read), privileged mode (write):  0x5 = This is the default value. The windowed watchdog will cause a reset if the watchdog  is serviced outside the time window defined by the configuration, or if the watchdog is not  serviced at all.  0xA = The windowed watchdog will generate a non-maskable interrupt to the CPU if the  watchdog is serviced outside the time window defined by the configuration, or if the  watchdog is not serviced at all.  Writing any other value will cause a system reset if the watchdog is serviced outside the  time window defined by the configuration, or if the watchdog is not serviced at all.  Note: Configuration of DWWD Reaction  The DWWD reaction can be selected by the application even when the DWWD  counter is already enabled.  If a change to the WWDRXN is made before the watchdog service window is opened,  then the change in the configuration takes effect immediately.  If a change to the WWDRXN is made when the watchdog service window is already  open, then the change in configuration takes effect only after the watchdog is  serviced." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_WWDSIZECTRL" acronym="CFG_WWDSIZECTRL" offset="0xA8" width="32" description="">
		<bitfield id="WWDSIZE" width="32" begin="31" end="0" resetval="0x5" description="  User and privilege mode (read), privileged mode (write):  Table 3. Windowed Watchdog Window Size Configuration  Value written to  WWDSIZE Window Size  0x00000005 100% (The functionality is the same as the standard  time-out digital watchdog.)  0x00000050 50%  0x00000500 25%  0x00005000 12.5%  0x00050000 6.25%  0x00500000 3.125%  Any other 3.125%  value  Note: Incorrect value being written to watchdog window size control register  If an incorerct value is written to the WWDSIZE field, or if a system disturbance  causes the WWDSIZE field to have a value other than 0x5, 0x50, 0x500, 0x5000,  0x50000, or 0x500000, then the window size will be configured to be 3.125%. This  increases the chances of getting a reset due to the windowed watchdog, which  enables the system to handle the cause for the incorrect configuration.  Note: Configuration of DWWD Window Size  The DWWD window size can be selected by the application even when the DWWD  counter is already enabled.  If a change to the WWDSIZE is made before the watchdog service window is opened,  then the change in the configuration takes effect immediately.  If a change to the WWDSIZE is made when the watchdog service window is already  open, then the change in configuration takes effect only after the watchdog is  serviced." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_INTCLRENABLE" acronym="CFG_INTCLRENABLE" offset="0xAC" width="32" description="">
		<bitfield id="INTCLRENABLE3" width="4" begin="27" end="24" resetval="0x5" description="  Enables the auto-clear functionality on the compare 3 interrupt.  User and Privileged mode (read):  0x5 = Auto-clear for compare 3 interrupt is disabled.  Any other value = Auto-clear for compare 3 interrupt is enabled.  Privileged mode (write):  0x5 = Disables the auto-clear functionality on the compare 3 interrupt.  Any other value = Enables the auto-clear functionality on the compare 3 interrupt. " range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="INTCLRENABLE2" width="4" begin="19" end="16" resetval="0x5" description="  Enables the auto-clear functionality on the compare 2 interrupt.  User and Privileged mode (read):  0x5 = Auto-clear for compare 2 interrupt is disabled.  Any other value = Auto-clear for compare 2 interrupt is enabled.  Privileged mode (write):  0x5 = Disables the auto-clear functionality on the compare 2 interrupt.  Any other value = Enables the auto-clear functionality on the compare 2 interrupt. " range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="INTCLRENABLE1" width="4" begin="11" end="8" resetval="0x5" description="  Enables the auto-clear functionality on the compare 1 interrupt.  User and Privileged mode (read):  0x5 = Auto-clear for compare 1 interrupt is disabled.  Any other value = Auto-clear for compare 1 interrupt is enabled.  Privileged mode (write):  0x5 = Disables the auto-clear functionality on the compare 1 interrupt.  Any other value = Enables the auto-clear functionality on the compare 1 interrupt. " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="INTCLRENABLE0" width="4" begin="3" end="0" resetval="0x5" description="  Enables the auto-clear functionality on the compare 0 interrupt.  User and Privileged mode (read):  0x5 = Auto-clear for compare 0 interrupt is disabled.  Any other value = Auto-clear for compare 0 interrupt is enabled.  Privileged mode (write):  0x5 = Disables the auto-clear functionality on the compare 0 interrupt.  Any other value = Enables the auto-clear functionality on the compare 0 interrupt.  Note: Hook-up of Compare Interrupt to a device pin  The RTI module generates up to 4 compare interrupts. The connection between one  or more of these compare interrupt(s) to a device pin is completely device-dependent.  Refer to the device datasheet to identify the actual pin(s) that connects to the compare  interrupt(s)." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_COMP0CLR" acronym="CFG_COMP0CLR" offset="0xB0" width="32" description="">
		<bitfield id="COMP0CLR" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a compare value, which is compared with the counter selected in the  compare control logic. If the Free Running Counter matches the compare value, the  compare 0 interrupt or DMA request line is cleared.  User and privilege mode (read):  current compare value  Privilege mode (write):  update of the compare register with a new compare value  Note: Reset behavior  A reset does not generate a compare match, since the compare logic will only be  active, when the associated counter block is enabled." range="31 - 0" rwaccess="R/W"/>
	</register>
